cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

brew 'ack'
brew 'coreutils'
brew 'git'
brew 'git-extras'
brew 'grc' # Generic Colouriser
brew 'imagemagick'
brew 'libgit2'
brew 'nvm'
brew 'openssl'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup' # kills shell eating bugs and weeds
brew 'spaceman-diff' # Git diff for images
brew 'spark' # Sparks graphs on cli
brew 'tree'
brew 'vv'
brew 'webkit2png'
brew 'wget', args: ['with-iri']

# Install more recent versions of some OS X tools.
brew 'vim', args: ['override-system-vi']
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'homebrew/php/php56'

cask '1password'
cask 'atom'
cask 'charles'
cask 'dropbox'
cask 'filezilla'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'gpgtools'
cask 'hipchat'
cask 'iterm2'
cask 'libreoffice'
cask 'phpstorm'
cask 'poedit'
cask 'postman'
cask 'sequel-pro'
cask 'sketch'
cask 'sourcetree'
cask 'spotify'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
